from gettext import install
from operator import index
import pandas as pd

df = pd.read_html("자료실/sample.html")

print("----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------")
print(df)

print(len(df)) # 테이블 총 2개
print("-------------------------------------------------")
print(df[0]) # 1번째 테이블
print("-------------------------------------------------")
print(df[1])
print("-------------------------------------------------")

df[0].set_index(['c0'],inplace=True)
print(df[0])

print("-------------------------------------------------")
df[1].set_index(['name'],inplace=True) # 'name'컬럼을 index로 쓰겠다.
print(df[1])